Revit 2026 API

# RibbonItem Methods

---

The RibbonItem type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | Equals | Determines whether the specified Object is equal to the current Object. (Overrides ObjectEquals(Object)) |
|  | GetContextualHelp | Gets the contextual help bound with this control. |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | SetContextualHelp | Sets the contextual help bound with this button. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

RibbonItem Class

Autodesk.Revit.UI Namespace